# BuiltInFailures.MatchlineFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MatchlineFailures Class
BuiltInFailures Class Members See Also
---
Failures about Matchline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class MatchlineFailures
```

Visual Basic
---
```text
Public NotInheritable Class MatchlineFailures
```

Visual C++
---
```text
public ref class MatchlineFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..MatchlineFailures
# See Also
BuiltInFailures..::..MatchlineFailures Members
Autodesk.Revit.DB Namespace